'''
Социальная сеть

В социальной сети есть два вида пользователей: люди и сообщества.
Все пользователи должны указывать свое имя.
Люди могут также указывать свою дату рождения, а сообщества — своё краткое описание.
Все пользователи (и люди, и сообщества) могут отправлять сообщения друг другу, 
а также выкладывать посты на своей стене.
Люди могут подписываться на других людей и на сообщества.
Реализуйте иерархию классов в соответствии с этим описанием.

User — базовый класс. Его конструктор должен принимать один аргумент — имя. 
Также этот класс должен предоставлять методы

send_message (user, message) — отправить сообщение message пользователю user

post (message) — отправить сообщение message себе на стену

info () — вернуть строку с дополнительной информацией о пользователе. 
Для класса User это пустая строка, метод info () будет переопределяться в производных классах

describe () — напечатать имя пользователя и дополнительную информацию о нем 
(т.е. результат работы метода info ())

Person — производный от класса User. Его конструктор должен принимать на вход два аргумента — 
имя и дату рождения. Метод info () класса Person должен возвращать строку вида «Дата рождения:…» 
Также у Person должен быть реализован дополнительный метод subscribe (user), 
где user — объект класса User.

Community — производный от класса User. Его конструктор должен принимать на вход два аргумента — 
имя и краткое описание. Метод info () класса Community должен возвращать строку вида «Описание:…»
'''


class User:
    def __init__(self, name):
        self.name = name

    def send_message(self, user, message):
        print(f'Отправить пользователю {user} сообщение: \"{message}\"')

    def post(message):
        print(f'Отправить сообщение на стену:\"\{message}"')

    def info():
        